#использовать "../src/core"
#Использовать asserts
#Использовать logos

Перем юТест;
Перем Лог;

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт

	юТест = Тестирование;
	
	ИменаТестов = Новый Массив;
	
	ИменаТестов.Добавить("ТестДолжен_ПроверитьРазборкуПравилОбмена");
	
	Возврат ИменаТестов;

КонецФункции

Процедура ТестДолжен_ПроверитьРазборкуПравилОбмена() Экспорт
	
	КаталогРаспаковки = ВременныеФайлы.СоздатьКаталог();
	ПутьКФайлуПравила = ТестовыеПравила();

	ОбработчикПравил = Новый ОбработкаПравил();
	ОбработчикПравил.РазложитьПравилаКонвертации(ПутьКФайлуПравила, КаталогРаспаковки);

	МассивФайлов = НайтиФайлы(КаталогРаспаковки, "*.*", Истина);

	Ожидаем.Что(МассивФайлов.Количество(), "Количество файлов должно быть больше 0").Больше(0);

	ВременныеФайлы.УдалитьФайл(КаталогРаспаковки);

КонецПроцедуры

Функция ТестовыеПравила()
	Возврат ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures","fake-rules.xml");
КонецФункции