#использовать "../src/core"
#Использовать asserts
#Использовать logos

Перем юТест;
Перем Лог;
Перем КаталогРаспаковки;

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт

	юТест = Тестирование;
	
	ИменаТестов = Новый Массив;
	
	ИменаТестов.Добавить("ТестДолжен_ПроверитьРазборкуПравилОбмена");
	ИменаТестов.Добавить("ТестДолжен_ПроверитьРазборкуПравилОбменаССозданиемПараметровДляАлгоритмов");
	ИменаТестов.Добавить("ТестДолжен_ПроверитьРазборкуПравилРегистрации");

	Возврат ИменаТестов;

КонецФункции

Процедура ПередОкончаниемСценария() Экспорт
	ВременныеФайлы.УдалитьФайл(КаталогРаспаковки);
КонецПроцедуры

Процедура ТестДолжен_ПроверитьРазборкуПравилОбмена() Экспорт
	
	КаталогРаспаковки = ВременныеФайлы.СоздатьКаталог();
	ПутьКФайлуПравила = ТестовыеПравила();

	ОбработчикПравил = Новый ОбработкаПравил();
	ОбработчикПравил.РазложитьПравилаКонвертации(ПутьКФайлуПравила, КаталогРаспаковки);

	МассивФайлов = НайтиФайлы(КаталогРаспаковки, "*.*", Истина);

	Ожидаем.Что(МассивФайлов.Количество(), "Количество файлов должно быть больше 0").Больше(0);

КонецПроцедуры

Процедура ТестДолжен_ПроверитьРазборкуПравилРегистрации() Экспорт
	
	КаталогРаспаковки = ВременныеФайлы.СоздатьКаталог();
	ПутьКФайлуПравила = ТестовыеПравила("ПравилаРегистрации");

	ОбработчикПравил = Новый ОбработкаПравил();
	ОбработчикПравил.РазложитьПравилаКонвертации(ПутьКФайлуПравила, КаталогРаспаковки);

	МассивФайлов = НайтиФайлы(КаталогРаспаковки, "*.*", Истина);

	Ожидаем.Что(МассивФайлов.Количество(), "Количество файлов должно быть больше 0").Больше(0);

КонецПроцедуры

Процедура ТестДолжен_ПроверитьРазборкуПравилОбменаССозданиемПараметровДляАлгоритмов() Экспорт
	
	Результат = Ложь;

	МассивФайлов = НайтиФайлы(КаталогРаспаковки, "Параметры", Истина);

	Для каждого СтрокаМассива Из МассивФайлов Цикл
		Если СтрокаМассива.ЭтоФайл() Тогда
			Результат = Истина;
		КонецЕсли;	
	КонецЦикла;

	Ожидаем.Что(Результат, "Должен быть файл Параметры").Равно(Истина);

КонецПроцедуры

Функция ТестовыеПравила(ТипПравил = "ПравилаОбмена")
	// по умолчанию
	Значение = ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures", "fake-rules.xml");
	Если ТипПравил = "ПравилаРегистрации" Тогда
		Значение = ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures", "fake-registration-rules.xml");
	КонецЕсли;
	Возврат Значение;
КонецФункции