#использовать "../src/core"
#Использовать asserts
#Использовать logos
#Использовать fs

Перем юТест;
Перем Лог;

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт

	юТест = Тестирование;	
	ИменаТестов = Новый Массив;
	ИменаТестов.Добавить("ТестДолжен_ПроверитьСборкуПравилОбмена");
	ИменаТестов.Добавить("ТестДолжен_ПроверитьСборкуПравилРегистрации");
	
	Возврат ИменаТестов;

КонецФункции

Процедура ТестДолжен_ПроверитьСборкуПравилОбмена() Экспорт

	БазовыйКаталог = ПолучитьТестовыйКаталогДляСборки();
	КаталогSRC = ОбъединитьПути(БазовыйКаталог, "src");
	ФС.ОбеспечитьПустойКаталог(КаталогSRC);
	МенеджерПравил = Новый ОбработкаПравил();
	
	//Подготовим разборку
	Сообщить("Разборка..");
	ПутьКПравиламОбмена = ПолучитьТестовыеПравилаКонвертации("ПравилаОбмена");
	ИмяПравилОбмена = ОбщийФункционал.ПолучитьИмяФайла(ПутьКПравиламОбмена);
	МенеджерПравил.РазложитьПравилаКонвертации(ПутьКПравиламОбмена, КаталогSRC);
	
	КаталогИсходныхФайлов = ОбъединитьПути(КаталогSRC, ИмяПравилОбмена);

	МассивФайлов = НайтиФайлы(КаталогИсходныхФайлов, "*.*", Истина);
	Ожидаем.Что(МассивФайлов.Количество(), "Количество файлов должно быть больше 0").Больше(0);

	//Сделаем сборку
	Сообщить("Сборка..");
	МенеджерПравил.СобратьПравилаКонвертации(КаталогИсходныхФайлов, БазовыйКаталог);
	
	//Проверим что файл сборки создан
	МассивФайлов = НайтиФайлы(БазовыйКаталог, ИмяПравилОбмена);
	Ожидаем.Что(МассивФайлов.Количество(), "Файл со сборкой правил должен быть найден").Больше(0);

	УдалитьФайлы(БазовыйКаталог);

КонецПроцедуры

Процедура ТестДолжен_ПроверитьСборкуПравилРегистрации() Экспорт

	//КаталогСборки = ПолучитьТестовыйКаталогДляСборки();

КонецПроцедуры

Функция ПолучитьТестовыйКаталогДляСборки()
	ПутьККаталогу = ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures", "assembly"); 
	ФС.ОбеспечитьПустойКаталог(ПутьККаталогу);
	Возврат ПутьККаталогу;
КонецФункции

Функция ПолучитьТестовыеПравилаКонвертации(ТипПравил = "ПравилаОбмена")
	// по умолчанию
	Значение = ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures","fake-rules.xml");
	Если ТипПравил = "ПравилаОбмена" Тогда
		Значение = ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures","fake-rules.xml");
	ИначеЕсли ТипПравил = "ПравилаРегистрации" Тогда
		Значение = ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures","fake-rules.xml");
	КонецЕсли;
	Возврат Значение;
КонецФункции